---
kind: type
id: T:Autodesk.Revit.DB.SymbolicCurveArrayIterator
source: html/3704a568-7aac-0b3a-ce43-d461d2ea845a.htm
---
# Autodesk.Revit.DB.SymbolicCurveArrayIterator

An iterator to a model curve array.

## Syntax (C#)
```csharp
public abstract class SymbolicCurveArrayIterator : APIObject,
	IEnumerator
```